load-tests/artillery.yml
# Configuração base do Artillery para testes de carga do Quiz
# Target e variáveis podem ser sobrescritas via --environment ou env vars

config:
  target: "http://localhost:3000"
  phases:
    - name: "warmup"
      duration: 10
      arrivalRate: 1
    - name: "sustained"
      duration: 30
      arrivalRate: 2
  engines:
    socketio-v3: {}
  processor: "./functions.js"
  variables:
    roomCode: "LOAD01"
    participantName: "User_1"
    optionIndex: 0
    thinkTime: 2